---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.MeganewtonMetersPerMeter
source: html/d62831b9-56b8-57f4-8510-6e89f55a5702.htm
---
# Autodesk.Revit.DB.UnitTypeId.MeganewtonMetersPerMeter Property

Meganewton meters per meter.

## Syntax (C#)
```csharp
public static ForgeTypeId MeganewtonMetersPerMeter { get; }
```